# 定義
# 以下のように完全に囲われてる文章を含むテキストを「effect」として定義する

#       ----------------------------------
#       |                                |
#       |              TEXT              |
#       |                                |
#       ----------------------------------

module Effect

#--------------------PKスタート--------------------
  def start_pk_effect
    puts <<~TEXT
         ----------------------------------
         |                                |
         |           PK GEAM              |
         |                                |
         ----------------------------------

         ----------------------------------
         |                                |
         |           KICK OFF!            |
         |                                |
         ----------------------------------

    TEXT
  end

#--------------------ゴールが決まった時--------------------
  def get_goal_effect
    puts <<~TEXT



         ----------------------------------
         |                                |
         |         GOOOOOOOOOAL!!!!       |
         |                                |
         ----------------------------------

                 ゴ━━━━(ﾟ∀ﾟ)━━━━ル!!



    TEXT
  end
#--------------------セーブされた時--------------------
  def save_effect
    puts <<~TEXT



        ----------------------------------
        |                                |
        |     ××××  NO GOAL  ××××××      |
        |                                |
        ----------------------------------

                  ファインセーブ！！



    TEXT
  end

#--------------------勝った時--------------------
  def win_effect
    puts <<~TEXT



         ----------------------------------
         |                                |
         |      👑  👑  WINER 👑   👑      |
         |                                |
         ----------------------------------

                  勝ちました！！！！！！！
                  おめでとうございます！



    TEXT
    #もう一度やりますか？
  end


#--------------------負けた時--------------------
  def lose_effect
    puts <<~TEXT



         ----------------------------------
         |                                |
         |           GAME OVER            |
         |                                |
         ----------------------------------

                  あなたは負けました・・・。



    TEXT
    # もう一度挑戦しますか？
  end

#--------------------サドンデスに突入--------------------
  def sudden_death_effect
    puts <<~TEXT

        ----------------------------------
        |                                |
        |         SUDDEN DEATH           |
        |                                |
        ----------------------------------

                サドンデスの突入です！！

          ここからは時間がないので、巻いていきます
              次のキッカーは準備してください




    TEXT
  end

end