require './user'
require './com'
require './player'


puts <<~TEXT
    ----------------------------------
    |                                |
    |           PK GEAM              |
    |                                |
    ----------------------------------
   
    ----------------------------------
    |                                |
    |           KICK OFF!            |
    |                                |
    ----------------------------------
    

  TEXT



  user = User.new
  com = Com.new

  #両チーム５回ずつ蹴る  
  5.times{|i|
    
    puts <<~EOS
          ---------------------------------
             ユーザーの#{i + 1}人目のキッカーです
          ---------------------------------
    EOS
    
    user.kick

    puts <<~EOS
          ---------------------------------
             COMの#{i + 1}人目のキッカーです
          ---------------------------------
    EOS

    com.kick  
  }

 
  # 最終結果の表示
  com.judgment
  


